## repositories plan
```
module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.github.github_repository.default: Refreshing state... [id=.github]
module.operations-engineering-terraform-github-repositories.github_repository.default: Refreshing state... [id=operations-engineering-terraform-github-repositories]
module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.terraform-template-poc.github_repository.default: Refreshing state... [id=terraform-template-poc]
module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTcwNjE4ODQ=]
module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.template-repository.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTIzMzA5Mzg=]
module.github-actions.data.github_actions_public_key.default: Reading...
module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.github-actions.github_repository_tag_protection.default: Refreshing state... [id=164901]
module.operations-engineering-reports.github_repository_tag_protection.default: Refreshing state... [id=165169]
module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.operations-engineering-reports.github_actions_secret.default["KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-reports:KUBE_TOKEN]
module.operations-engineering-reports.github_actions_secret.default["CVE_SCAN_SLACK_WEBHOOK"]: Refreshing state... [id=operations-engineering-reports:CVE_SCAN_SLACK_WEBHOOK]
module.github-actions.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.operations-engineering-reports.github_actions_secret.default["PROD_FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-reports:PROD_FLASK_APP_SECRET]
module.operations-engineering-reports.github_actions_secret.default["DEVELOPMENT_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_ROLE_TO_ASSUME]
module.operations-engineering-reports.github_actions_secret.default["DEV_OPS_ENG_REPORTS_ENCRYPT_KEY"]: Refreshing state... [id=operations-engineering-reports:DEV_OPS_ENG_REPORTS_ENCRYPT_KEY]
module.operations-engineering-reports.github_actions_secret.default["DEV_KUBE_CERT"]: Refreshing state... [id=operations-engineering-reports:DEV_KUBE_CERT]
module.operations-engineering-reports.github_actions_secret.default["DEV_OPERATIONS_ENGINEERING_REPORTS_API_KEY"]: Refreshing state... [id=operations-engineering-reports:DEV_OPERATIONS_ENGINEERING_REPORTS_API_KEY]
module.operations-engineering-reports.github_actions_secret.default["PROD_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-reports:PROD_KUBE_NAMESPACE]
module.operations-engineering-reports.github_actions_secret.default["PROD_OPERATIONS_ENGINEERING_REPORTS_API_KEY"]: Refreshing state... [id=operations-engineering-reports:PROD_OPERATIONS_ENGINEERING_REPORTS_API_KEY]
module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-reports.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=operations-engineering-reports:SLACK_WEBHOOK_URL]
module.operations-engineering-reports.github_actions_secret.default["KUBE_CERT"]: Refreshing state... [id=operations-engineering-reports:KUBE_CERT]
module.operations-engineering-reports.github_actions_secret.default["PROD_KUBE_CERT"]: Refreshing state... [id=operations-engineering-reports:PROD_KUBE_CERT]
module.operations-engineering-reports.github_actions_secret.default["DEV_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-reports:DEV_KUBE_TOKEN]
module.operations-engineering-reports.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-reports:KUBE_CLUSTER]
module.operations-engineering-reports.github_actions_secret.default["PROD_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-reports:PROD_KUBE_TOKEN]
module.operations-engineering-reports.github_actions_secret.default["DEV_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-reports:DEV_KUBE_CLUSTER]
module.operations-engineering-reports.github_actions_secret.default["DEV_FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-reports:DEV_FLASK_APP_SECRET]
module.operations-engineering-reports.github_actions_secret.default["KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-reports:KUBE_NAMESPACE]
module.operations-engineering-reports.github_actions_secret.default["PROD_OPS_ENG_REPORTS_ENCRYPT_KEY"]: Refreshing state... [id=operations-engineering-reports:PROD_OPS_ENG_REPORTS_ENCRYPT_KEY]
module.operations-engineering-reports.github_actions_secret.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.operations-engineering-reports.github_actions_secret.default["DEV_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-reports:DEV_KUBE_NAMESPACE]
module.operations-engineering-reports.github_actions_secret.default["PROD_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-reports:PROD_KUBE_CLUSTER]
module.operations-engineering-reports.github_actions_secret.default["PRODUCTION_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_ROLE_TO_ASSUME]
module.operations-engineering-reports.github_actions_secret.default["AUTH0_CLIENT_ID"]: Refreshing state... [id=operations-engineering-reports:AUTH0_CLIENT_ID]
module.operations-engineering-reports.github_actions_secret.default["OPS_ENG_REPORTS_ENCRYPT_KEY"]: Refreshing state... [id=operations-engineering-reports:OPS_ENG_REPORTS_ENCRYPT_KEY]
module.operations-engineering-reports.github_actions_secret.default["FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-reports:FLASK_APP_SECRET]
module.operations-engineering-reports.github_actions_secret.default["OPERATIONS_ENGINEERING_REPORTS_API_KEY"]: Refreshing state... [id=operations-engineering-reports:OPERATIONS_ENGINEERING_REPORTS_API_KEY]
module.operations-engineering-reports.github_actions_secret.default["AUTH0_CLIENT_SECRET"]: Refreshing state... [id=operations-engineering-reports:AUTH0_CLIENT_SECRET]
module.cloud-platform-maintenance-pages.github_repository_tag_protection.default: Refreshing state... [id=164899]
module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_NAMESPACE"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_NAMESPACE]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_TOKEN"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_TOKEN]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_CLUSTER]
module.cloud-platform-maintenance-pages.github_actions_secret.default["ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=cloud-platform-maintenance-pages:ECR_ROLE_TO_ASSUME]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_CERT"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_CERT]
module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.operations-engineering-join-github.github_actions_secret.default["PROD_ADMIN_GITHUB_TOKEN"]: Refreshing state... [id=operations-engineering-join-github:PROD_ADMIN_GITHUB_TOKEN]
module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.operations-engineering-join-github.github_actions_secret.default["PROD_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_ROLE_TO_ASSUME]
module.operations-engineering-join-github.github_actions_secret.default["PROD_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-join-github:PROD_KUBE_NAMESPACE]
module.operations-engineering-join-github.github_actions_secret.default["PROD_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-join-github:PROD_KUBE_TOKEN]
module.operations-engineering-join-github.github_actions_secret.default["DEV_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-join-github:DEV_KUBE_TOKEN]
module.operations-engineering-join-github.github_actions_secret.default["FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-join-github:FLASK_APP_SECRET]
module.operations-engineering-join-github.github_actions_secret.default["DEV_FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-join-github:DEV_FLASK_APP_SECRET]
module.operations-engineering-join-github.github_actions_secret.default["PROD_KUBE_CERT"]: Refreshing state... [id=operations-engineering-join-github:PROD_KUBE_CERT]
module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.operations-engineering-join-github.github_actions_secret.default["DEV_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-join-github:DEV_KUBE_NAMESPACE]
module.operations-engineering-join-github.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-join-github:KUBE_CLUSTER]
module.operations-engineering-join-github.github_actions_secret.default["PROD_FLASK_APP_SECRET"]: Refreshing state... [id=operations-engineering-join-github:PROD_FLASK_APP_SECRET]
module.operations-engineering-join-github.github_actions_secret.default["AUTH0_CLIENT_ID"]: Refreshing state... [id=operations-engineering-join-github:AUTH0_CLIENT_ID]
module.operations-engineering-join-github.github_actions_secret.default["DEV_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_ROLE_TO_ASSUME]
module.operations-engineering-join-github.github_actions_secret.default["DEV_KUBE_CERT"]: Refreshing state... [id=operations-engineering-join-github:DEV_KUBE_CERT]
module.operations-engineering-join-github.github_actions_secret.default["DEV_ADMIN_GITHUB_TOKEN"]: Refreshing state... [id=operations-engineering-join-github:DEV_ADMIN_GITHUB_TOKEN]
module.operations-engineering-join-github.github_actions_secret.default["AUTH0_CLIENT_SECRET"]: Refreshing state... [id=operations-engineering-join-github:AUTH0_CLIENT_SECRET]
module.operations-engineering-join-github.github_repository_tag_protection.default: Refreshing state... [id=165170]
module.technical-guidance.github_branch_protection.default: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlOTg2NzQz]
module.technical-guidance.github_actions_secret.default["GH_BOT_PAT_TOKEN"]: Refreshing state... [id=technical-guidance:GH_BOT_PAT_TOKEN]
module.technical-guidance.github_actions_secret.default["OPS_BOT_TOKEN"]: Refreshing state... [id=technical-guidance:OPS_BOT_TOKEN]
module.technical-guidance.github_actions_secret.default["OPERATIONS_ENGINEERING"]: Refreshing state... [id=technical-guidance:OPERATIONS_ENGINEERING]
module.technical-guidance.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=technical-guidance:SLACK_WEBHOOK_URL]
module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.moj-terraform-aws-sso.github_repository_tag_protection.default: Refreshing state... [id=164896]
module.github.data.github_actions_public_key.default: Reading...
module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.github.github_repository_tag_protection.default: Refreshing state... [id=164900]
module.operations-engineering-terraform-github-repositories.github_repository_tag_protection.default: Refreshing state... [id=165167]
module.operations-engineering-terraform-github-repositories.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwPF7]
module.operations-engineering-terraform-github-repositories.data.github_actions_public_key.default: Reading...
module.github-collaborators.github_actions_secret.default["OPS_BOT_TOKEN_ENABLED"]: Refreshing state... [id=github-collaborators:OPS_BOT_TOKEN_ENABLED]
module.github-collaborators.data.github_actions_public_key.default: Reading...
module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.github-collaborators.github_repository_tag_protection.default: Refreshing state... [id=164898]
module.github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.github-collaborators.github_actions_secret.default["OPS_BOT_TOKEN"]: Refreshing state... [id=github-collaborators:OPS_BOT_TOKEN]
module.github-collaborators.github_actions_secret.default["SEND_TO_NOTIFY"]: Refreshing state... [id=github-collaborators:SEND_TO_NOTIFY]
module.github-collaborators.github_actions_secret.default["POST_TO_SLACK"]: Refreshing state... [id=github-collaborators:POST_TO_SLACK]
module.github-collaborators.github_actions_secret.default["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=github-collaborators:AWS_ACCESS_KEY_ID]
module.github-collaborators.github_actions_secret.default["APP_INSTALLATION_ID"]: Refreshing state... [id=github-collaborators:APP_INSTALLATION_ID]
module.operations-engineering-terraform-github-repositories.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.github-collaborators.github_actions_secret.default["NOTIFY_TEST_TOKEN"]: Refreshing state... [id=github-collaborators:NOTIFY_TEST_TOKEN]
module.github-collaborators.github_actions_secret.default["POST_TO_GH"]: Refreshing state... [id=github-collaborators:POST_TO_GH]
module.github-collaborators.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.github-collaborators.github_actions_secret.default["APP_ID"]: Refreshing state... [id=github-collaborators:APP_ID]
module.github-collaborators.github_actions_secret.default["NOTIFY_PROD_TOKEN"]: Refreshing state... [id=github-collaborators:NOTIFY_PROD_TOKEN]
module.github-collaborators.github_actions_secret.default["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=github-collaborators:AWS_SECRET_ACCESS_KEY]
module.github-collaborators.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=github-collaborators:SLACK_WEBHOOK_URL]
module.github-collaborators.github_actions_secret.default["APP_PEM_FILE"]: Refreshing state... [id=github-collaborators:APP_PEM_FILE]
module.moj-terraform-scim-github.github_repository_tag_protection.default: Refreshing state... [id=164897]
module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4BiZD_]
module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.operations-engineering-certificate-renewal.github_repository_tag_protection.default: Refreshing state... [id=165171]
module.operations-engineering-certificate-renewal.github_actions_secret.default["AWS_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:AWS_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["UNDELIVERED_REPORT_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:UNDELIVERED_REPORT_TEMPLATE_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["GANDI_API_KEY"]: Refreshing state... [id=operations-engineering-certificate-renewal:GANDI_API_KEY]
module.operations-engineering-certificate-renewal.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=operations-engineering-certificate-renewal:SLACK_WEBHOOK_URL]
module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.operations-engineering-certificate-renewal.github_actions_secret.default["SONAR_TOKEN"]: Refreshing state... [id=operations-engineering-certificate-renewal:SONAR_TOKEN]
module.operations-engineering-certificate-renewal.github_actions_secret.default["GANDI_ORG_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:GANDI_ORG_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["S3_OBJECT_NAME"]: Refreshing state... [id=operations-engineering-certificate-renewal:S3_OBJECT_NAME]
module.operations-engineering-certificate-renewal.github_actions_secret.default["S3_BUCKET_NAME"]: Refreshing state... [id=operations-engineering-certificate-renewal:S3_BUCKET_NAME]
module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering-certificate-renewal.github_actions_secret.default["EXPIRE_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:EXPIRE_TEMPLATE_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["REQUEST_GANDI_FUNDS_REPORT_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:REQUEST_GANDI_FUNDS_REPORT_TEMPLATE_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["NOTIFY_API_KEY"]: Refreshing state... [id=operations-engineering-certificate-renewal:NOTIFY_API_KEY]
module.operations-engineering-certificate-renewal.github_actions_secret.default["REQUEST_GANDI_FUNDS_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:REQUEST_GANDI_FUNDS_TEMPLATE_ID]
module.operations-engineering-certificate-renewal.github_actions_secret.default["REPORT_TEMPLATE_ID"]: Refreshing state... [id=operations-engineering-certificate-renewal:REPORT_TEMPLATE_ID]
module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default: Refreshing state... [id=165168]
module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.operations-engineering-metadata-poc.github_actions_secret.default["DEV_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-metadata-poc:DEV_KUBE_NAMESPACE]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEV_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-metadata-poc:DEV_KUBE_TOKEN]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEV_KUBE_CERT"]: Refreshing state... [id=operations-engineering-metadata-poc:DEV_KUBE_CERT]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEV_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-metadata-poc:DEV_KUBE_CLUSTER]
module.operations-engineering-metadata-poc.github_actions_secret.default["DEVELOPMENT_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_ROLE_TO_ASSUME]
module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.operations-engineering-metadata-poc.github_repository_tag_protection.default: Refreshing state... [id=165174]
module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.operations-engineering-user-guide.github_repository_tag_protection.default: Refreshing state... [id=165176]
module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.operations-engineering-user-guide.github_actions_secret.default["GH_BOT_PAT_TOKEN"]: Refreshing state... [id=operations-engineering-user-guide:GH_BOT_PAT_TOKEN]
module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.operations-engineering-example.github_actions_secret.default["DEV_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-example:DEV_KUBE_CLUSTER]
module.operations-engineering-example.github_actions_secret.default["PRODUCTION_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_ROLE_TO_ASSUME]
module.operations-engineering-example.github_actions_secret.default["PROD_KUBE_CERT"]: Refreshing state... [id=operations-engineering-example:PROD_KUBE_CERT]
module.operations-engineering-example.github_actions_secret.default["PROD_KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering-example:PROD_KUBE_CLUSTER]
module.operations-engineering-example.github_actions_secret.default["DEV_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-example:DEV_KUBE_TOKEN]
module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.operations-engineering-example.github_actions_secret.default["PROD_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-example:PROD_KUBE_NAMESPACE]
module.operations-engineering-example.github_actions_secret.default["DEV_KUBE_CERT"]: Refreshing state... [id=operations-engineering-example:DEV_KUBE_CERT]
module.operations-engineering-example.github_actions_secret.default["DEV_KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering-example:DEV_KUBE_NAMESPACE]
module.operations-engineering-example.github_actions_secret.default["DEVELOPMENT_ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_ROLE_TO_ASSUME]
module.operations-engineering-example.github_actions_secret.default["PROD_KUBE_TOKEN"]: Refreshing state... [id=operations-engineering-example:PROD_KUBE_TOKEN]
module.operations-engineering-example.github_repository_tag_protection.default: Refreshing state... [id=165173]
module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4BhL5F]
module.tech-docs-monitor.github_actions_secret.default["SLACK_TOKEN"]: Refreshing state... [id=tech-docs-monitor:SLACK_TOKEN]
module.tech-docs-monitor.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=tech-docs-monitor:SLACK_WEBHOOK_URL]
module.tech-docs-monitor.github_actions_secret.default["REALLY_POST_TO_SLACK"]: Refreshing state... [id=tech-docs-monitor:REALLY_POST_TO_SLACK]
module.acronyms.github_repository_tag_protection.default: Refreshing state... [id=164902]
module.acronyms.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=acronyms:SLACK_WEBHOOK_URL]
module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.acronyms.data.github_actions_public_key.default: Reading...
module.terraform-template-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOJKjnDs4CqPje]
module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.terraform-template-poc.github_actions_secret.default["GH_ACCESS_TOKEN"]: Refreshing state... [id=terraform-template-poc:GH_ACCESS_TOKEN]
module.terraform-template-poc.github_actions_secret.default["AWS_STATE_ACCESS_KEY_ID"]: Refreshing state... [id=terraform-template-poc:AWS_STATE_ACCESS_KEY_ID]
module.terraform-template-poc.github_actions_secret.default["AWS_STATE_SECRET_ACCESS_KEY"]: Refreshing state... [id=terraform-template-poc:AWS_STATE_SECRET_ACCESS_KEY]
module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.operations-engineering-runbooks.github_repository_tag_protection.default: Refreshing state... [id=165175]
module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.operations-engineering-runbooks.github_actions_secret.default["GH_BOT_PAT_TOKEN"]: Refreshing state... [id=operations-engineering-runbooks:GH_BOT_PAT_TOKEN]
module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84BgDZp]
module.acronyms.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.tech-docs-github-pages-publisher.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=tech-docs-github-pages-publisher:SLACK_WEBHOOK_URL]
module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.operations-engineering.data.github_actions_public_key.default: Reading...
module.operations-engineering.github_repository_tag_protection.default: Refreshing state... [id=165184]
module.operations-engineering.github_actions_secret.default["METADATA_API_URL"]: Refreshing state... [id=operations-engineering:METADATA_API_URL]
module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.operations-engineering.github_actions_secret.default["SENTRY_TOKEN"]: Refreshing state... [id=operations-engineering:SENTRY_TOKEN]
module.operations-engineering.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=operations-engineering:KUBE_CLUSTER]
module.operations-engineering.github_actions_secret.default["KUBE_NAMESPACE"]: Refreshing state... [id=operations-engineering:KUBE_NAMESPACE]
module.operations-engineering.github_actions_secret.default["TERRAFORM_ADMIN_DEV_LEVG"]: Refreshing state... [id=operations-engineering:TERRAFORM_ADMIN_DEV_LEVG]
module.operations-engineering.github_actions_secret.default["TERRAFORM_GITHUB_REPOS_S3_ROLE_ARN_PROD"]: Refreshing state... [id=operations-engineering:TERRAFORM_GITHUB_REPOS_S3_ROLE_ARN_PROD]
module.operations-engineering.github_actions_secret.default["AUTH0_OPERATIONS_ENGINEERING_DEV_DEFAULT_CLIENTID"]: Refreshing state... [id=operations-engineering:AUTH0_OPERATIONS_ENGINEERING_DEV_DEFAULT_CLIENTID]
module.operations-engineering.github_actions_secret.default["SLACK_BOT_TOKEN"]: Refreshing state... [id=operations-engineering:SLACK_BOT_TOKEN]
module.operations-engineering.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.operations-engineering.github_actions_secret.default["KUBE_CERT"]: Refreshing state... [id=operations-engineering:KUBE_CERT]
module.operations-engineering.github_actions_secret.default["ROUTE53_HOSTEDZONE_ID_2"]: Refreshing state... [id=operations-engineering:ROUTE53_HOSTEDZONE_ID_2]
module.operations-engineering.github_actions_secret.default["SONAR_TOKEN"]: Refreshing state... [id=operations-engineering:SONAR_TOKEN]
module.operations-engineering.github_actions_secret.default["ROUTE53_HOSTEDZONE_ID_1"]: Refreshing state... [id=operations-engineering:ROUTE53_HOSTEDZONE_ID_1]
module.operations-engineering.github_actions_secret.default["AUTH0_OPERATIONS_ENGINEERING_DEV_DOMAIN"]: Refreshing state... [id=operations-engineering:AUTH0_OPERATIONS_ENGINEERING_DEV_DOMAIN]
module.operations-engineering.github_actions_secret.default["AUTH0_CLIENT_SECRET"]: Refreshing state... [id=operations-engineering:AUTH0_CLIENT_SECRET]
module.operations-engineering.github_actions_secret.default["TERRAFORM_GITHUB_REPOS_S3_ROLE_ARN_DEV"]: Refreshing state... [id=operations-engineering:TERRAFORM_GITHUB_REPOS_S3_ROLE_ARN_DEV]
module.operations-engineering.github_actions_secret.default["METADATA_API_TOKEN"]: Refreshing state... [id=operations-engineering:METADATA_API_TOKEN]
module.operations-engineering.github_actions_secret.default["OPS_BOT_TOKEN"]: Refreshing state... [id=operations-engineering:OPS_BOT_TOKEN]
module.operations-engineering.github_actions_secret.default["CLOUD_PLATFORM_MOJ_GITHUB_TOKEN"]: Refreshing state... [id=operations-engineering:CLOUD_PLATFORM_MOJ_GITHUB_TOKEN]
module.operations-engineering.github_actions_secret.default["S3_BUCKET_NAME"]: Refreshing state... [id=operations-engineering:S3_BUCKET_NAME]
module.operations-engineering.github_actions_secret.default["NOTIFY_PROD_API_KEY"]: Refreshing state... [id=operations-engineering:NOTIFY_PROD_API_KEY]
module.operations-engineering.github_actions_secret.default["AWS_ID_DORMANT_USERS"]: Refreshing state... [id=operations-engineering:AWS_ID_DORMANT_USERS]
module.operations-engineering.github_actions_secret.default["AUTH0_CLIENT_ID"]: Refreshing state... [id=operations-engineering:AUTH0_CLIENT_ID]
module.operations-engineering.github_actions_secret.default["ADMIN_SEND_TO_SLACK"]: Refreshing state... [id=operations-engineering:ADMIN_SEND_TO_SLACK]
module.operations-engineering.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=operations-engineering:SLACK_WEBHOOK_URL]
module.operations-engineering.github_actions_secret.default["TERRAFORM_AUTH0_S3_ROLE_ARN_DEV"]: Refreshing state... [id=operations-engineering:TERRAFORM_AUTH0_S3_ROLE_ARN_DEV]
module.operations-engineering.github_actions_secret.default["AUTO_REVIEW_DATE"]: Refreshing state... [id=operations-engineering:AUTO_REVIEW_DATE]
module.operations-engineering.github_actions_secret.default["GH_BOT_AUDIT_LOG_PAT_TOKEN"]: Refreshing state... [id=operations-engineering:GH_BOT_AUDIT_LOG_PAT_TOKEN]
module.operations-engineering.github_actions_secret.default["KUBE_TOKEN"]: Refreshing state... [id=operations-engineering:KUBE_TOKEN]
module.operations-engineering.github_actions_secret.default["ADMIN_GITHUB_TOKEN_ENTERPRISE_DATA"]: Refreshing state... [id=operations-engineering:ADMIN_GITHUB_TOKEN_ENTERPRISE_DATA]
module.operations-engineering.github_actions_secret.default["AUTH0_DOMAIN"]: Refreshing state... [id=operations-engineering:AUTH0_DOMAIN]
module.operations-engineering.github_actions_secret.default["OPERATIONS_ENGINEERING"]: Refreshing state... [id=operations-engineering:OPERATIONS_ENGINEERING]
module.operations-engineering.github_actions_secret.default["CODECOV_TOKEN"]: Refreshing state... [id=operations-engineering:CODECOV_TOKEN]
module.operations-engineering.github_actions_secret.default["GH_BOT_PAT_TOKEN"]: Refreshing state... [id=operations-engineering:GH_BOT_PAT_TOKEN]
module.operations-engineering.github_actions_secret.default["AWS_ID"]: Refreshing state... [id=operations-engineering:AWS_ID]
module.operations-engineering.github_actions_secret.default["NOTIFY_TEST_API_KEY"]: Refreshing state... [id=operations-engineering:NOTIFY_TEST_API_KEY]
module.operations-engineering.github_actions_secret.default["LOGGING_LEVEL"]: Refreshing state... [id=operations-engineering:LOGGING_LEVEL]
module.operations-engineering.github_actions_secret.default["REPORTS_API_KEY"]: Refreshing state... [id=operations-engineering:REPORTS_API_KEY]
module.operations-engineering.github_actions_secret.default["AUTH0_OPERATIONS_ENGINEERING_DEV_DEFAULT_CLIENTSECRET"]: Refreshing state... [id=operations-engineering:AUTH0_OPERATIONS_ENGINEERING_DEV_DEFAULT_CLIENTSECRET]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.tech-docs-github-pages-publisher.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "tech-docs-github-pages-publisher"
    }

  # module.tech-docs-github-pages-publisher.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOE7RAx84BgDZp" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnkzMzA1ODAxNjc=" -> "tech-docs-github-pages-publisher" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.tech-docs-github-pages-publisher.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Docker image to publish MoJ documentation repositories as github pages sites" -> "Docker image to publish MoJ documentation repositories as github pages sites • This repository is defined and managed in Terraform"
        id                          = "tech-docs-github-pages-publisher"
        name                        = "tech-docs-github-pages-publisher"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.tech-docs-github-pages-publisher.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "tech-docs-github-pages-publisher"
      + tag_protection_id = (known after apply)
    }

  # module.tech-docs-monitor.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "tech-docs-monitor"
    }

  # module.tech-docs-monitor.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOHQFa_s4BhL5F" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOHQFa_g" -> "tech-docs-monitor" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.tech-docs-monitor.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Part of alphagov/tech-docs-template (issues 👉https://github.com/alphagov/tech-docs-template/issues)" -> "Part of alphagov/tech-docs-template (issues 👉https://github.com/alphagov/tech-docs-template/issues) • This repository is defined and managed in Terraform"
        id                          = "tech-docs-monitor"
        name                        = "tech-docs-monitor"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tech-docs-monitor.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "tech-docs-monitor"
      + tag_protection_id = (known after apply)
    }

  # module.technical-guidance.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "technical-guidance"
    }

  # module.technical-guidance.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlOTg2NzQz" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnk5ODg5NDgwMg==" -> "technical-guidance" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismiss_stale_reviews           = false -> true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (3 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [] -> null
          ~ strict   = true -> false
        }
    }

  # module.technical-guidance.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      + archive_on_destroy          = true
      ~ description                 = "How we build and operate products at the Ministry of Justice." -> "How we build and operate products at the Ministry of Justice. • This repository is defined and managed in Terraform"
        id                          = "technical-guidance"
        name                        = "technical-guidance"
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.technical-guidance.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "technical-guidance"
      + tag_protection_id = (known after apply)
    }

  # module.template-documentation-site.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "template-documentation-site"
    }

  # module.template-documentation-site.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTcwNjE4ODQ=" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnkyODUzMTkyNDY=" -> "template-documentation-site" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.template-documentation-site.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Template repo. for a gov.uk tech-docs-template documentation site published via github pages" -> "Template repo. for a gov.uk tech-docs-template documentation site published via github pages • This repository is defined and managed in Terraform"
      ~ has_wiki                    = true -> false
        id                          = "template-documentation-site"
        name                        = "template-documentation-site"
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.template-documentation-site.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "template-documentation-site"
      + tag_protection_id = (known after apply)
    }

  # module.template-repository.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "template-repository"
    }

  # module.template-repository.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTIzMzA5Mzg=" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnkyMjcwOTA2OTE=" -> "template-repository" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (4 unchanged attributes hidden)
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.template-repository.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Github \"template\" repository, from which to create new MoJ Repositories with organisation defaults" -> "Github \"template\" repository, from which to create new MoJ Repositories with organisation defaults • This repository is defined and managed in Terraform"
      ~ has_wiki                    = true -> false
        id                          = "template-repository"
        name                        = "template-repository"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.template-repository.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "template-repository"
      + tag_protection_id = (known after apply)
    }

  # module.terraform-aws-mtasts.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "terraform-aws-mtasts"
    }

  # module.terraform-aws-mtasts.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOHWUugs4BiZD_" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOHWUugg" -> "terraform-aws-mtasts" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismiss_stale_reviews           = false -> true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - restrict_dismissals             = false -> null
            # (3 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [] -> null
          ~ strict   = true -> false
        }
    }

  # module.terraform-aws-mtasts.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "MTA-STS/TLS-RPT AWS Terraform Module" -> "MTA-STS/TLS-RPT AWS Terraform Module • This repository is defined and managed in Terraform"
      ~ has_issues                  = false -> true
        id                          = "terraform-aws-mtasts"
        name                        = "terraform-aws-mtasts"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform-aws-mtasts.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "terraform-aws-mtasts"
      + tag_protection_id = (known after apply)
    }

  # module.terraform-template-poc.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "terraform-template-poc"
    }

  # module.terraform-template-poc.github_branch_protection.default must be replaced
-/+ resource "github_branch_protection" "default" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOJKjnDs4CqPje" -> (known after apply)
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOJKjnDg" -> "terraform-template-poc" # forces replacement
        # (9 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          ~ require_code_owner_reviews      = false -> true
          - restrict_dismissals             = false -> null
            # (3 unchanged attributes hidden)
        }

      ~ required_status_checks {
          - contexts = [
              - "Get All Top Level Directories Changed Under `terraform/`",
            ] -> null
          ~ strict   = true -> false
        }
    }

  # module.terraform-template-poc.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      - allow_update_branch         = true -> null
      + archive_on_destroy          = true
      ~ description                 = "A Proof of Concept for a resilient and scalable Terraform template, suitable for team use" -> "A Proof of Concept for a resilient and scalable Terraform template, suitable for team use • This repository is defined and managed in Terraform"
      ~ has_wiki                    = true -> false
        id                          = "terraform-template-poc"
        name                        = "terraform-template-poc"
      ~ squash_merge_commit_message = "BLANK" -> "COMMIT_MESSAGES"
      ~ squash_merge_commit_title   = "PR_TITLE" -> "COMMIT_OR_PR_TITLE"
        # (28 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }
          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.terraform-template-poc.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "terraform-template-poc"
      + tag_protection_id = (known after apply)
    }

Plan: 14 to add, 7 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```